export const newsList = {
  '2022-11-21': [
    {
      id: 1,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1669030467,
      city: 'Новосибирск',
    },
    {
      id: 2,
      title: 'Минусовая температура и снегопады в Новосибирске',
      text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
      time: 1669032027,
      city: 'Новосибирск',
    }
    ,
    {
      id: 3,
      title: 'Образовательный микробизнес в Новосибирске показал рост',
      text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
      time: 1669039227,
      city: 'Новосибирск',
    }
    ,
    {
      id: 4,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1669046427,
      city: 'Новосибирск',
    }
    ,
    {
      id: 5,
      title:
        'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1669053627,
      city: 'Новосибирск',
    }
  ],
  '2022-11-20': [
    {
      id: 6,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668944067,
      city: 'Новосибирск',
    }
    ,
    {
      id: 7,
      title: 'Минусовая температура и снегопады в Новосибирске',
      text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
      time: 1668945627,
      city: 'Новосибирск',
    }
    ,
    {
      id: 8,
      title: 'Образовательный микробизнес в Новосибирске показал рост',
      text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
      time: 1668952827,
      city: 'Новосибирск',
    }
    ,
    {
      id: 9,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668960027,
      city: 'Новосибирск',
    }
    ,
    {
      id: 10,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668967227,
      city: 'Новосибирск',
    }
  ],
  '2022-11-19': [
    {
      id: 11,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668857667,
      city: 'Новосибирск',
    }
    ,
    {
      id: 12,
      title: 'Минусовая температура и снегопады в Новосибирске',
      text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
      time: 1668859227,
      city: 'Новосибирск',
    }
    ,
    {
      id: 13,
      title: 'Образовательный микробизнес в Новосибирске показал рост',
      text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
      time: 1668866427,
      city: 'Новосибирск',
    }
    ,
    {
      id: 14,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668873627,
      city: 'Новосибирск',
    }
    ,
    {
      id: 15,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668880827,
      city: 'Новосибирск',
    }
  ],
  '2022-11-18': [
    {
      id: 16,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668771267,
      city: 'Новосибирск',
    }
    ,
    {
      id: 17,
      title: 'Минусовая температура и снегопады в Новосибирске',
      text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
      time: 1668772827,
      city: 'Новосибирск',
    }
    ,
    {
      id: 18,
      title: 'Образовательный микробизнес в Новосибирске показал рост',
      text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
      time: 1668780027,
      city: 'Новосибирск',
    }
    ,
    {
      id: 19,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668787227,
      city: 'Новосибирск',
    }
    ,
    {
      id: 20,
      title: 'Новосибирск вошел в топ самых дорогих миллионников',
      text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
      time: 1668794427,
      city: 'Новосибирск',
    }
    ,]
}
