<template>
  <section class="news">
    <Breadcrumbs/>

    <div class="news__columns">
      <h1 class="news__title">Новости</h1>

      <FilterList
        title="Выбрать город"
        titleClass="news__city-title"
        name="cities"
        :hasIcon="false"
        defaultValue="all"
        :filterItems="citiesList"
        :isDefaultOpen="false"
      />

      <ul class="news__list">
        <li
          v-for="(value, key) of newsList"
          :key="key">
          <h2 class="news__date">
            {{ getDateText(key) }}
          </h2>

          <NewsDayList
            :itemList="value"
            :hasSlot="Object.keys(newsList)[0] === key"
          >
            <AsideHorizontal containerClass="news__aside-horizontal"/>

            <AsideVertical containerClass="news__aside-vertical_slot"/>
          </NewsDayList>
        </li>
      </ul>

      <AsideVertical containerClass="news__aside-vertical_column"/>
    </div>
  </section>
</template>

<script>
import NewsDayList from "~/components/NewsDayList";
import AsideVertical from "~/components/AsideVertical";
import FilterList from "~/components/FilterList";
import Breadcrumbs from "~/components/Breadcrumbs";

export default {
  name: 'IndexPage',

  components: {
    Breadcrumbs,
    FilterList,
    NewsDayList,
    AsideVertical
  },

  data() {
    return {
      newsList: {
        '2022-11-21': [
          {
            id: 1,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1669030467,
            city: 'Новосибирск',
          },
          {
            id: 2,
            title: 'Минусовая температура и снегопады в Новосибирске',
            text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
            time: 1669032027,
            city: 'Новосибирск',
          }
          ,
          {
            id: 3,
            title: 'Образовательный микробизнес в Новосибирске показал рост',
            text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
            time: 1669039227,
            city: 'Новосибирск',
          }
          ,
          {
            id: 4,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1669046427,
            city: 'Новосибирск',
          }
          ,
          {
            id: 5,
            title:
              'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1669053627,
            city: 'Новосибирск',
          }
        ],
        '2022-11-20': [
          {
            id: 6,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668944067,
            city: 'Новосибирск',
          }
          ,
          {
            id: 7,
            title: 'Минусовая температура и снегопады в Новосибирске',
            text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
            time: 1668945627,
            city: 'Новосибирск',
          }
          ,
          {
            id: 8,
            title: 'Образовательный микробизнес в Новосибирске показал рост',
            text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
            time: 1668952827,
            city: 'Новосибирск',
          }
          ,
          {
            id: 9,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668960027,
            city: 'Новосибирск',
          }
          ,
          {
            id: 10,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668967227,
            city: 'Новосибирск',
          }
        ],
        '2022-11-19': [
          {
            id: 11,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668857667,
            city: 'Новосибирск',
          }
          ,
          {
            id: 12,
            title: 'Минусовая температура и снегопады в Новосибирске',
            text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
            time: 1668859227,
            city: 'Новосибирск',
          }
          ,
          {
            id: 13,
            title: 'Образовательный микробизнес в Новосибирске показал рост',
            text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
            time: 1668866427,
            city: 'Новосибирск',
          }
          ,
          {
            id: 14,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668873627,
            city: 'Новосибирск',
          }
          ,
          {
            id: 15,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668880827,
            city: 'Новосибирск',
          }
        ],
        '2022-11-18': [
          {
            id: 16,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668771267,
            city: 'Новосибирск',
          }
          ,
          {
            id: 17,
            title: 'Минусовая температура и снегопады в Новосибирске',
            text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
            time: 1668772827,
            city: 'Новосибирск',
          }
          ,
          {
            id: 18,
            title: 'Образовательный микробизнес в Новосибирске показал рост',
            text: 'Аналитики Авито Услуг и агентства Data Insight изучили работу самозанятых репетиторов и компаний штатом до 15 человек (частных школ, образовательных проектов, секций и «кружков»).',
            time: 1668780027,
            city: 'Новосибирск',
          }
          ,
          {
            id: 19,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668787227,
            city: 'Новосибирск',
          }
          ,
          {
            id: 20,
            title: 'Новосибирск вошел в топ самых дорогих миллионников',
            text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
            time: 1668794427,
            city: 'Новосибирск',
          }
          ,]
      },
      citiesList: [
        {
          id: 1,
          label: 'Красноярск'
        },
        {
          id: 2,
          label: 'Богучаны'
        },
        {
          id: 3,
          label: 'Тайшет'
        },
        {
          id: 4,
          label: 'Шелехов'
        },
        {
          id: 5,
          label: 'Абакан'
        },
        {
          id: 6,
          label: 'Саяногорск'
        },
        {
          id: 7,
          label: 'Дивногорск'
        },
        {
          id: 8,
          label: 'Ачинск'
        },
        {
          id: 9,
          label: 'Иркутск'
        },
        {
          id: 10,
          label: 'Брянск'
        },
        {
          id: 11,
          label: 'Новосибирск'
        },
        {
          id: 12,
          label: 'Омск'
        },
        {
          id: 13,
          label: 'Томск'
        },
        {
          id: 14,
          label: 'Кемерово'
        },
      ],
    }
  },

  methods: {
    getDateText(date) {
      const monthsOnRu = [
        'января',
        'февраля',
        'марта',
        'апреля',
        'мая',
        'июня',
        'июля',
        'августа',
        'сентября',
        'октября',
        'ноября',
        'декабря'
      ];
      const [year, month, day] = date.split('-');
      const nowDay = (new Date()).toLocaleDateString();

      return nowDay === `${day}.${month}.${year}`
        ? 'Сегодня'
        : `${day} ${monthsOnRu[month - 1]}`
    }
  }

}
</script>

<style>
.news {
  display: flex;
  flex-direction: column;
}

.news__columns {
  margin-top: 47px;
  display: grid;
  grid-template-columns: repeat(2, minmax(min-content, max-content));
  justify-content: space-between;
}

.news__title {
  margin: 0;
  font-weight: 700;
  font-size: 24px;
  line-height: 1.58;
  text-transform: uppercase;
  color: var(--black-color);
}

.filter__title.news__city-title {
  margin-right: 12px;
  align-self: flex-end;
  justify-self: flex-end;
  gap: 5px;
  max-width: max-content;
  font-weight: 500;
  font-size: 16px;
  line-height: 1.62;
}

.news__list {
  max-width: 768px;
  display: flex;
  flex-direction: column;
  gap: 60px;
  padding: 0;
  margin: 40px 0 0;
  list-style-type: none;
}

.news__date {
  margin: 0 0 20px;
  font-weight: 700;
  font-size: 24px;
  line-height: 1.58;
  color: var(--black-color);
}

.news__aside-vertical_slot {
  display: none;
}

@media (max-width: 1200px) {
  .news__columns {
    grid-column-gap: 40px;
  }
}

@media (max-width: 1023px) {
  .news__columns {
    margin-top: 32px;
    grid-template-columns: 1fr;
  }

  .news__title {
    margin-bottom: 18px;
    font-size: 20px;
    line-height: 1.4;
  }

  .filter__title.news__city-title {
    align-self: flex-start;
    max-width: 100%;
    width: 100%;
    margin-right: 0;
    letter-spacing: .8px;
  }

  .news__list {
    gap: 50px;
  }

  .news__date {
    font-size: 20px;
    line-height: 1.4;
  }

  .news__aside-horizontal {
    display: none;
  }

  .news__aside-vertical_slot {
    display: flex;
  }

  .news__aside-vertical_column {
    display: none;
  }
}

</style>
